Repository: samiyamohammed/alfaruq
Catalog: app-frontend/lib/l10n/app_*.arb
Languages: am

source: App Settings
am: የመተግበሪያ ቅንብሮች

source: Language
am: ቋንቋ

source: Theme
am: ገጽታ

source: Privacy Policy
am: የግላዊነት ፖሊሲ

source: English
am: እንግሊዝኛ

source: Amharic
am: አማርኛ

source: Afaan Oromo
am: ኦሮምኛ

# navHome
source: Home
am: ዋና ገጽ

# navVideos
source: Videos
am: ቪዲዮዎች

# navMovies
source: Movies
am: ፊልሞች

# navQiblah
source: Qiblah
am: ቂብላ

# navProfile
source: Profile
am: መገለጫ

# sectionTrailers
source: New Trailers
am: አዳዲስ ማስታወቂያዎች

# sectionPopularMovies
source: Popular Movies
am: ተወዳጅ ፊልሞች

# sectionSeries
source: Series
am: ተከታታይ ፊልሞች

# sectionMusicVideos
source: Music Videos
am: የነሺዳ ቪዲዮዎች

source: See All
am: ሁሉንም ይመልከቱ

# noContent
source: No content available.
am: ምንም ይዘት የለም

# tabPlaylists
source: Playlists
am: ዝርዝሮች

# tabMovies
source: Movies
am: ፊልሞች

# tabSeries
source: Series
am: ተከታታይ

# tabMusicVideos
source: Music Videos
am: ነሺዳ

# tabTrailers
source: Trailers
am: ማስታወቂያዎች

source: Search playlists...
am: ዝርዝሮችን ይፈልጉ...

source: No videos found.
am: ምንም ቪዲዮዎች አልተገኙም

# libraryTitle
source: Library
am: ቤተ-መጽሐፍት

source: No content found.
am: ምንም ይዘት አልተገኘም

# qiblahTitle
source: Qiblah Compass
am: የቂብላ አቅጣጫ

source: Qiblah Direction
am: የቂብላ አቅጣጫ

# alignDevice
source: Align the top of your device with the Kaaba direction
am: ስልክዎን ከካዕባ አቅጣጫ ጋር ያስተካክሉ

# calibrateWarning
source: Wave your device in a figure-8 to calibrate
am: ስልክዎን በ 8 ቅርጽ ያንቀሳቅሱ

# locationFetching
source: Fetching location...
am: ቦታ በመፈለግ ላይ...

source: Location unavailable
am: ቦታ አልተገኘም

# compassError
source: Failed to initialize Qiblah compass
am: ኮምፓስ መክፈት አልተቻለም

# deviceNotSupported
source: Your device does not support compass sensor
am: ስልክዎ ኮምፓስ አይደግፍም

source: Retry
am: እንደገና ይሞክሩ

# profileTitle
source: Profile & Settings
am: መገለጫ እና ቅንብሮች

source: Account Settings
am: የመለያ ቅንብሮች

source: Prayer Reminders
am: የሶላት ማስታወሻዎች

source: Log Out
am: ውጣ

# logOutConfirmation
source: Are you sure you want to log out?
am: እርግጠኛ ነዎት መውጣት ይፈልጋሉ?

source: Cancel
am: ሰርዝ

source: Loading...
am: በመጫን ላይ...

source: Please wait
am: እባክዎ ይጠብቁ

source: Error
am: ስህተት

source: Change Password
am: የይለፍ ቃል ይቀይሩ

source: Manage Subscription
am: የደንበኝነት ምዝገባን ያስተዳድሩ

source: Delete Account
am: መለያ ይሰርዙ

source: Reminder Settings
am: የማስታወሻ ቅንብሮች

source: Enable All Reminders
am: ሁሉንም ማስታወሻዎች ያብሩ

source: Notification Behavior
am: የማሳወቂያ ባህሪ

source: Reminder Sound
am: የማስታወሻ ድምጽ

source: Vibration
am: ንዝረት

# soundLabel
source: Sound
am: ድምጽ

# prayerFajr
source: Fajr
am: ፈጅር

# prayerSunrise
source: Sunrise
am: ፀሐይ መውጫ

# prayerDhuhr
source: Dhuhr
am: ዙህር

# prayerAsr
source: Asr
am: አስር

# prayerMaghrib
source: Maghrib
am: መግሪብ

# prayerIsha
source: Isha
am: ኢሻ

source: No data
am: ምንም ውሂብ የለም

source: General Settings
am: አጠቃላይ ቅንብሮች

# managePreferences
source: Manage your account and app preferences
am: መለያዎን እና የመተግበሪያ ምርጫዎችን ያስተዳድሩ

# sectionAccount
source: ACCOUNT
am: መለያ

# generalSettingsTile
source: General Settings
am: አጠቃላይ ቅንብሮች

source: Profile, password & more
am: መገለጫ፣ የይለፍ ቃል እና ሌሎችም

source: Notification Settings
am: የማሳወቂያ ቅንብሮች

source: Manage notification preferences
am: የማሳወቂያ ምርጫዎችን ያስተዳድሩ

# sectionApp
source: APP
am: መተግበሪያ

source: App Language
am: የመተግበሪያ ቋንቋ

source: Privacy & Security
am: ግላዊነት እና ደህንነት

# managePrivacy
source: Manage your privacy
am: ግላዊነትዎን ያስተዳድሩ

# sectionOther
source: OTHER
am: ሌላ

source: About
am: ስለ እኛ

# signOutSubtitle
source: Sign out of your account
am: ከመለያዎ ይውጡ

source: Select Language
am: ቋንቋ ይምረጡ

source: Menu
am: ሜኑ

source: Categories
am: ምድቦች

source: Translated Movies
am: ተርጓሚ ፊልሞች

source: Series Movies
am: ተከታታይ ፊልሞች

source: Premium Nesheed
am: ፕሪሚየም ነሺዳ

source: Quran Tafseer
am: ቁርአን ተፍሲር

source: Prophet History
am: የነብያት ታሪክ

source: Documentaries
am: ዶክመንተሪዎች

source: Alfaruk Kheber
am: አልፋሩቅ ዜና

source: Yene Movie
am: የኔ ፊልም

source: Khadim
am: ኻዲም

source: Iqra - Read & Listen
am: ኢቅራ - አንብብ እና አዳምጥ

source: YouTube Content
am: የዩቲዩብ ይዘት

source: Dawah (Free)
am: ዳዕዋ (ነፃ)

source: Settings
am: ቅንብሮች

source: Service
am: አገልግሎት

source: Donation
am: ልገሳ

# supportCauses
source: Support our causes
am: ዓላማዎቻችንን ይደግፉ

source: Halal Gebeya
am: ሃላል ገበያ

source: Islamic marketplace
am: የእስላማዊ ገበያ ቦታ

source: Event Tickets
am: የክስተት ቲኬቶች

# bookEvents
source: Book your events
am: ለክስተቶች ይመዝገቡ

source: Our YouTube Partners
am: የዩቲዩብ አጋሮቻችን

# connectCreators
source: Connect with creators
am: ከፈጣሪዎች ጋር ይገናኙ

source: Coming Soon
am: በቅርቡ ይጠብቁ

source: Mosque Locator
am: መስጂድ ፈላጊ

source: Qibla Finder
am: ቂብላ ፈላጊ

source: Today's Prayer Times
am: የዛሬ የሶላት ጊዜያት

source: PDF Books
am: ፒዲኤፍ መጽሐፍት

source: Audio Books
am: ኦዲዮ መጽሐፍት

source: Watch Trailer
am: ማስታወቂያ ይመልከቱ

source: Trailer not available
am: ማስታወቂያ አይገኝም

source: Read More
am: ተጨማሪ ያንብቡ

source: Read Less
am: ያሳንሱ

source: Surah
am: ሱራ

source: Tap to play
am: ለማጫወት ይንኩ

source: All
am: ሁሉም

source: No Sheikhs found
am: ምንም ሼኮች አልተገኙም

source: Surahs Available
am: ሱራዎች ይገኛሉ

source: Your saved movies
am: የእርስዎ የተቀመጡ ፊልሞች

# swipeToSwitch
source: Swipe left/right to switch tabs
am: ትሮችን ለመቀየር ወደ ግራ/ቀኝ ያንሸራትቱ

source: Favorites
am: ተወዳጆች

source: Nasheeds
am: ነሺዳዎች

source: No saved movies
am: ምንም የተቀመጡ ፊልሞች የሉም

# addMoviesHint
source: Add movies using the Add List button
am: የዝርዝር አዝራሩን በመጠቀም ፊልሞችን ያክሉ

source: No saved nasheeds
am: ምንም የተቀመጡ ነሺዳዎች የሉም

# addNasheedsHint
source: Add nasheeds using the Add List button
am: የዝርዝር አዝራሩን በመጠቀም ነሺዳዎችን ያክሉ

source: No favorites yet
am: ምንም ተወዳጆች የሉም

# markFavoritesHint
source: Mark items as favorite to see them here
am: እዚህ ለማየት ንጥሎችን እንደ ተወዳጅ ምልክት ያድርጉ

source: Browse Content
am: ይዘትን ያስሱ

source: Subscribe
am: ሰብስክራይብ

source: Our Channels
am: የእኛ ቻናሎች

source: Popular Videos
am: ታዋቂ ቪዲዮዎች

# subscribeSubtitle
source: Subscribe to our YouTube channels for more Islamic content
am: ለተጨማሪ ኢስላማዊ ይዘቶች የዩቲዩብ ቻናሎቻችንን ሰብስክራይብ ያድርጉ

# descQuran
source: Quran recitation and tafsir
am: የቁርአን ቲላዋ እና ተፍሲር

# descKnowledge
source: Islamic knowledge and education
am: ኢስላማዊ እውቀት እና ትምህርት

# descMovies
source: Islamic movies and series
am: ኢስላማዊ ፊልሞች እና ተከታታይ ፊልሞች

# descTalkShow
source: Islamic talk shows and discussions
am: ኢስላማዊ የውይይት መድረኮች

source: Book Details
am: የመጽሐፍ ዝርዝሮች

source: Unknown Author
am: ያልታወቀ ደራሲ

source: Read Book
am: መጽሐፍ ያንብቡ

source: Listen Book
am: መጽሐፍ ያዳምጡ

source: Genre
am: ዓይነት

source: Pages
am: ገጾች

source: Year
am: ዓመት

source: Book Summary
am: የመጽሐፍ ማጠቃለያ

source: About This Book
am: ስለዚህ መጽሐፍ

source: Iqra
am: ኢቅራ

source: Profile Information
am: የመገለጫ መረጃ

source: Full Name
am: ሙሉ ስም

source: Email Address
am: ኢሜይል አድራሻ

source: Current Password
am: የአሁኑ የይለፍ ቃል

source: New Password
am: አዲስ የይለፍ ቃል

source: Confirm New Password
am: አዲሱን የይለፍ ቃል ያረጋግጡ

source: Enter current password
am: የአሁኑን የይለፍ ቃል ያስገቡ

source: Enter new password
am: አዲስ የይለፍ ቃል ያስገቡ

# confirmNewPasswordHint
source: Confirm new password
am: አዲሱን የይለፍ ቃል ያረጋግጡ

# minSixChars
source: Min 6 chars
am: ቢያንስ 6 ፊደላት

source: Passwords do not match
am: የይለፍ ቃሎች አይዛመዱም

source: Update Password
am: የይለፍ ቃል አዘምን

source: Required
am: አስፈላጊ

source: Failed to load profile
am: መገለጫ መጫን አልተቻለም

# privacyPolicyTitle
source: Privacy Policy for AL FARUK App
am: የአል-ፋሩቅ መተግበሪያ የግላዊነት ፖሊሲ

# lastUpdated
source: Last updated: February, 2025
am: መጨረሻ የተሻሻለው፡ የካቲት 2025

# privacyIntro
source: Your privacy is important to us. This privacy policy explains how we collect, use, and protect your information when you use the AL FARUK mobile application (the "App"). By using the App, you agree to the collection and use of information in accordance with this policy.
am: የእርስዎ ግላዊነት ለእኛ አስፈላጊ ነው። ይህ የግላዊነት ፖሊሲ የአል-ፋሩቅ የሞባይል መተግበሪያን ሲጠቀሙ የእርስዎን መረጃ እንዴት እንደምንሰበስብ፣ እንደምንጠቀም እና እንደምንጠብቅ ያብራራል። መተግበሪያውን በመጠቀም፣ በዚህ ፖሊሲ መሠረት መረጃን ለመሰብሰብ እና ለመጠቀም ተስማምተዋል።

source: Companies
am: ኩባንያዎች

# trustedOrgs
source: Trusted organizations you can support
am: ሊደግፏቸው የሚችሉ ታማኝ ድርጅቶች

source: Urgent Cases
am: ድንገተኛ ሁኔታዎች

# urgentCasesDesc
source: Urgent cases needing immediate support
am: አስቸኳይ ድጋፍ የሚሹ ጉዳዮች

source: View Urgent Cases
am: ድንገተኛ ጉዳዮችን ይመልከቱ

# supportCommunity
source: Support our community
am: ማህበረሰባችንን ይደግፉ

# eduPrograms
source: Educational programs
am: የትምህርት ፕሮግራሞች

# healthInitiatives
source: Healthcare initiatives
am: የጤና ክብካቤ ውጥኖች

# communitySupport
source: Community support initiatives
am: የማህበረሰብ ድጋፍ ተነሳሽነት

source: Youth programs
am: የወጣቶች ፕሮግራሞች

source: Islamic conference
am: እስላማዊ ኮንፈረንስ

source: Community gathering
am: የማህበረሰብ ስብስብ

source: Cultural event
am: ባህላዊ ዝግጅት

source: Youth festival
am: የወጣቶች ፌስቲቫል

# couldNotLaunch
source: Could not open link
am: ሊንኩን መክፈት አልተቻለም

source: Detail
am: ዝርዝር

source: WATCH NOW
am: አሁን ይመልከቱ

source: Add List
am: ዝርዝር ያክሉ

source: Movie Details
am: የፊልም ዝርዝሮች

source: WATCH FREE
am: በነፃ ይመልከቱ
